app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            artist = User.find(params[:user_id])
            render json: artist.comments
        elsif params[:artwork_id]
            artwork = Artwork.find(params[:artwork_id])
            render json: artwork.comments
        else
            render json: Comment.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("author_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["artwork_id", 2], ["body", "amazing!"], ["created_at", "2020-12-02 10:36:56.444464"], ["updated_at", "2020-12-02 10:36:56.444464"]]

    def destroy
        comment = Comment.find(params[:id])
        if comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 9]]