app/controllers/likes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "likes".* FROM "likes"
---
    def index
        if params[:user_id]
            liker = User.find(params[:user_id])
            render json: [liker.liked_artworks, liker.liked_comments]
        elsif params[:artwork_id]
            artwork = Artwork.find(params[:artwork_id])
            render json: artwork.likers
        elsif params[:comment_id]
            comment = Comment.find(params[:comment_id])
            render json: comment.likers
        else
            render json: Like.all