app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%"Szil"%')
SELECT "users".* FROM "users"
---
    def index
        unless params[:username].blank?
            name = params[:username]
            name = "%#{name}%"
            render json: User.where("username LIKE ?", name)
        else
            render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "endre"], ["updated_at", "2020-12-01 11:39:23.742773"], ["id", 17]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
    def destroy
        user = User.find(params[:id])
        if user.destroy